---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionType
source: html/59d96c60-67ae-cb70-d3a6-59e18a434eca.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionType

This element is used to describe the conceptual physical, construction, and energy properties in a manner
 that can be understood by both the Revit BIM model and Green Building Studio/Green Building XML.
 For serialization

## Syntax (C#)
```csharp
public class ConceptualConstructionType : ElementType
```